app/Http/Controllers/CategoryController.php

    public function index()
{
    $categories = Category::with('todos')->where('user_id', Auth::id())->get();
---
select * from `categories` where `user_id` = 1
select * from `todos` where `todos`.`category_id` in (4, 5, 6, 7)

    public function store(Request $request): RedirectResponse
    {
        $validated = $request->validate([
            'title' => 'required|string|max:255',
        ]);

        $request->user()->categories()->create($validated);
---
insert into `categories` (`title`, `user_id`, `updated_at`, `created_at`) values ('Title E', 1, '2025-05-18 10:05:27', '2025-05-18 10:05:27')

    public function update(Request $request, Category $category): RedirectResponse
    {
        // Match the authorization approach used in edit
        if (auth()->user()->id !== $category->user_id) {
            abort(403, 'Unauthorized action.');
        }

        $validated = $request->validate([
            'title' => 'required|string|max:255',
        ]);

        $category->update($validated);
---
update `categories` set `title` = 'Category E', `categories`.`updated_at` = '2025-05-18 10:05:40' where `id` = 7