app/Http/Controllers/TodoController.php

    public function index()
{
    // $todos = Todo::all();
    // $todos = Todo::where('user_id', Auth::id())->orderBy('created_at', 'desc')->get();
    // dd($todos);
    // $todos = Todo::where('user_id', Auth::id())
    //     ->orderBy('is_done', 'asc')
    //     ->orderBy('created_at', 'desc')
    //     ->paginate(10);
    $todos = Todo::with('category')
        ->where('user_id', Auth::id())
        ->orderBy('is_done', 'asc')
        ->orderBy('created_at', 'desc')
        ->paginate(10);

    $todosCompleted = Todo::where('user_id', Auth::id())
        ->where('is_done', true)
        ->count();
---
select * from `categories` where `categories`.`id` in (4, 5)
select * from `todos` where `user_id` = 1 order by `is_done` asc, `created_at` desc limit 10 offset 0
select count(*) as aggregate from `todos` where `user_id` = 1
select count(*) as aggregate from `todos` where `user_id` = 1 and `is_done` = 1