app/Http/Controllers/UserController.php

select * from `users` where `id` != '1' order by `name` asc limit 10 offset 0
select count(*) as aggregate from `users` where `id` != '1'
---
    public function index()
    {
        $search = request('search');

        if ($search) {
            $users = User::where(function ($query) use ($search) {
                    $query->where('name', 'like', '%' . $search . '%')
                          ->orWhere('email', 'like', '%' . $search . '%');
                })
                ->orderBy('name')
                ->where('id', '!=', '1')
                ->paginate(20)
                ->withQueryString(); // supaya pagination tetap membawa query search
        } else {
            $users = User::where('id', '!=', '1')
                        ->orderBy('name')
                        ->paginate(10);