app/Http/Controllers/UserController.php

select * from `todos` where `todos`.`user_id` in (8, 17, 20, 34, 41, 44, 56, 57, 90, 92)
select * from `users` where `id` != 1 order by `name` asc limit 10 offset 0
select count(*) as aggregate from `users` where `id` != 1
---
    public function index()
    {
        $search = request('search');

        if ($search) {
            $users = User::with('todos')
                ->where(function ($query) use ($search) {
                    $query->where('name', 'like', '%' . $search . '%')
                        ->orWhere('email', 'like', '%' . $search . '%');
                })
                ->orderBy('name')
                ->paginate(10);
        } else {
            $users = User::with('todos')
                ->where('id', '!=', 1)
                ->orderBy('name')
                ->paginate(10);